{
  "backend/main.mo": "Main actor implementing a trading education platform with user profiles, posts, courses, and enrollments, using authorization and blob storage mixins with migration support.",
  "backend/migration.mo": "Migration module defining data types and a run function to upgrade from OldActor (profiles and posts) to NewActor (adding courses and enrollments maps).",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for marketplace, course creation, course details, user courses section, and navigation, with high confidence and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration for the trading education platform UI.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using warm earth tones, avoiding blue and purple for financial platform aesthetics.",
  "frontend/index.html": "HTML entry point for the Stock Sphere application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for feed, profiles, marketplace, course pages, and profile setup modal for first-time authenticated users.",
  "frontend/src/components/CourseCard.tsx": "Course card component displaying thumbnail, title, description, creator profile with avatar, enrollment count, and price in ICP with hover effects and link to course detail.",
  "frontend/src/components/CreateCourseForm.tsx": "Form component for creating courses with title, description, price (in ICP/e8s), and thumbnail upload with progress tracking using ExternalBlob. Validates inputs and navigates to marketplace on success.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with a textarea limited to 1000 characters. Uses useAddPost mutation and displays character count and submission status.",
  "frontend/src/components/EditProfileForm.tsx": "Form component for editing user profile including name, bio, experience level, and profile picture upload with progress tracking. Pre-populates with current profile data and shows success feedback.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing navigation (Feed/Marketplace), login button, and footer with copyright and caffeine.ai attribution. Highlights active route.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author avatar, name, experience badge, timestamp, and content. Fetches author profile and links to profile page.",
  "frontend/src/components/PostFeed.tsx": "Renders a list of posts sorted by timestamp (newest first) using PostCard components. Shows loading skeletons or empty state message when appropriate.",
  "frontend/src/components/ProfileDisplay.tsx": "Displays user profile information including avatar, name, experience badge, bio, and truncated principal ID. Uses color-coded badges for experience levels.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup with fields for name, bio, experience level, and profile picture upload with progress tracking. Uses form state and mutation hook to save profile data.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, posts, courses, and enrollments. Each hook uses the actor from useActor and manages query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, professional color scheme for light and dark modes using oklch color space. Includes chart colors and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/CourseDetailPage.tsx": "Course detail page displaying course information, creator profile, enrollment status, and enrollment action. Fetches course data by ID and handles enrollment logic for authenticated users.",
  "frontend/src/pages/CreateCoursePage.tsx": "Page for creating new courses with authentication guard that redirects unauthenticated users. Renders CreateCourseForm component within a card layout with navigation back to marketplace.",
  "frontend/src/pages/EditProfilePage.tsx": "Page component for editing user profiles that displays EditProfileForm for authenticated users or prompts unauthenticated users to sign in with navigation back to feed or profile.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page displaying a hero banner, create post form for authenticated users, and a feed of all trading insights posts with loading states.",
  "frontend/src/pages/MarketplacePage.tsx": "Course marketplace page displaying all available courses in a grid layout with create course button for authenticated users and empty state handling.",
  "frontend/src/pages/UserProfilePage.tsx": "User profile page showing profile information, user posts, created courses, and enrolled courses with edit functionality for own profile and principal validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including typography and container queries plugins, custom animations, and professional financial dashboard styling.",
  "project_state.json": "Project metadata defining Stock Sphere as a trading community platform with Internet Identity authentication, social feed, course marketplace, and listing implemented features with requirement IDs."
}